iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define I2C4_0_0 (*(volatile struct I2C4_0_0_tag *) 0x40008400)

struct FLASH_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LATENCY:3;
      uint64_t reservedSpace0:5;
      uint64_t PRFTEN:1;
      uint64_t ICEN:1;
      uint64_t DCEN:1;
      uint64_t ICRST:1;
      uint64_t DCRST:1;
      uint64_t RUN_PD:1;
      uint64_t SLEEP_PD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPTKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPTKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOP:1;
      uint64_t OPERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PROGERR:1;
      uint64_t WRPERR:1;
      uint64_t PGAERR:1;
      uint64_t SIZERR:1;
      uint64_t PGSERR:1;
      uint64_t MISERR:1;
      uint64_t FASTERR:1;
      uint64_t reservedSpace1:4;
      uint64_t RDERR:1;
      uint64_t OPTVERR:1;
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:1;
      uint64_t PER:1;
      uint64_t MER1:1;
      uint64_t PNB:8;
      uint64_t BKER:1;
      uint64_t reservedSpace0:3;
      uint64_t MER2:1;
      uint64_t START:1;
      uint64_t OPTSTRT:1;
      uint64_t FSTPG:1;
      uint64_t reservedSpace1:5;
      uint64_t EOPIE:1;
      uint64_t ERRIE:1;
      uint64_t RDERRIE:1;
      uint64_t OBL_LAUNCH:1;
      uint64_t reservedSpace2:2;
      uint64_t OPTLOCK:1;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_ECC:19;
      uint64_t BK_ECC:1;
      uint64_t SYSF_ECC:1;
      uint64_t reservedSpace0:3;
      uint64_t ECCIE:1;
      uint64_t reservedSpace1:5;
      uint64_t ECCC:1;
      uint64_t ECCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDP:8;
      uint64_t BOR_LEV:3;
      uint64_t reservedSpace0:1;
      uint64_t nRST_STOP:1;
      uint64_t nRST_STDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t IDWG_SW:1;
      uint64_t IWDG_STOP:1;
      uint64_t IWDG_STDBY:1;
      uint64_t WWDG_SW:1;
      uint64_t BFB2:1;
      uint64_t DUALBANK:1;
      uint64_t reservedSpace2:1;
      uint64_t nBOOT1:1;
      uint64_t SRAM2_PE:1;
      uint64_t SRAM2_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1_STRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP1_END:16;
      uint64_t reservedSpace0:15;
      uint64_t PCROP_RDP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP1ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP1A_STRT:8;
      uint64_t reservedSpace0:8;
      uint64_t WRP1A_END:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP1AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP1B_END:8;
      uint64_t reservedSpace0:8;
      uint64_t WRP1B_STRT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP1BR;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP2_STRT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCROP2_END:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCROP2ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP2A_STRT:8;
      uint64_t reservedSpace0:8;
      uint64_t WRP2A_END:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP2AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP2B_STRT:8;
      uint64_t reservedSpace0:8;
      uint64_t WRP2B_END:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRP2BR;

};

#define FLASH_0_0 (*(volatile struct FLASH_0_0_tag *) 0x40022000)

struct DBGMCU_0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ID:16;
      uint64_t REV_ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_SLEEP:1;
      uint64_t DBG_STOP:1;
      uint64_t DBG_STANDBY:1;
      uint64_t reservedSpace0:2;
      uint64_t TRACE_IOEN:1;
      uint64_t TRACE_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIMER2_STOP:1;
      uint64_t DBG_TIM3_STOP:1;
      uint64_t DBG_TIM4_STOP:1;
      uint64_t DBG_TIM5_STOP:1;
      uint64_t DBG_TIMER6_STOP:1;
      uint64_t DBG_TIM7_STOP:1;
      uint64_t reservedSpace0:4;
      uint64_t DBG_RTC_STOP:1;
      uint64_t DBG_WWDG_STOP:1;
      uint64_t DBG_IWDG_STOP:1;
      uint64_t reservedSpace1:8;
      uint64_t DBG_I2C1_STOP:1;
      uint64_t DBG_I2C2_STOP:1;
      uint64_t DBG_I2C3_STOP:1;
      uint64_t reservedSpace2:1;
      uint64_t DBG_CAN_STOP:1;
      uint64_t reservedSpace3:5;
      uint64_t DBG_LPTIMER_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1_FZR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t DBG_LPTIM2_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1_FZR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t DBG_TIM1_STOP:1;
      uint64_t reservedSpace1:1;
      uint64_t DBG_TIM8_STOP:1;
      uint64_t reservedSpace2:2;
      uint64_t DBG_TIM15_STOP:1;
      uint64_t DBG_TIM16_STOP:1;
      uint64_t DBG_TIM17_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2_FZR;

