iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRC:1;
      uint64_t EPDISD:1;
      uint64_t reservedSpace0:1;
      uint64_t STUP:1;
      uint64_t OTEPDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t B2BSTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT3;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XFRSIZ:19;
      uint64_t PKTCNT:10;
      uint64_t RXDPID_STUPCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ3;

};

#define OTG_FS_DEVICE_0_1 (*(volatile struct OTG_FS_DEVICE_0_1_tag *) 0x50000800)

struct OTG_FS_PWRCLK_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STPPCLK:1;
      uint64_t GATEHCLK:1;
      uint64_t reservedSpace0:2;
      uint64_t PHYSUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FS_PCGCCTL;

};

#define OTG_FS_PWRCLK_0_1 (*(volatile struct OTG_FS_PWRCLK_0_1_tag *) 0x50000e00)

struct SWPMI1_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDMA:1;
      uint64_t TXDMA:1;
      uint64_t RXMODE:1;
      uint64_t TXMODE:1;
      uint64_t LPBK:1;
      uint64_t SWPACT:1;
      uint64_t reservedSpace0:4;
      uint64_t DEACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBFF:1;
      uint64_t TXBEF:1;
      uint64_t RXBERF:1;
      uint64_t RXOVRF:1;
      uint64_t TXUNRF:1;
      uint64_t RXNE:1;
      uint64_t TXE:1;
      uint64_t TCF:1;
      uint64_t SRF:1;
      uint64_t SUSP:1;
      uint64_t DEACTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRXBFF:1;
      uint64_t CTXBEF:1;
      uint64_t CRXBERF:1;
      uint64_t CRXOVRF:1;
      uint64_t CTXUNRF:1;
      uint64_t reservedSpace0:2;
      uint64_t CTCF:1;
      uint64_t CSRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBFIE:1;
      uint64_t TXBEIE:1;
      uint64_t RXBERIE:1;
      uint64_t RXOVRIE:1;
      uint64_t TXUNRIE:1;
      uint64_t RIE:1;
      uint64_t TIE:1;
      uint64_t TCIE:1;
      uint64_t SRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWP_TBYP:1;
      uint64_t SWP_CLASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OR;

};

#define SWPMI1_0_1 (*(volatile struct SWPMI1_0_1_tag *) 0x40008800)

struct OPAMP_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPAEN:1;
      uint64_t OPALPM:1;
      uint64_t OPAMODE:2;
      uint64_t PGA_GAIN:2;
      uint64_t reservedSpace0:2;
      uint64_t VM_SEL:2;
      uint64_t VP_SEL:1;
      uint64_t reservedSpace1:1;
      uint64_t CALON:1;
      uint64_t CALSEL:1;
      uint64_t USERTRIM:1;
      uint64_t CALOUT:1;
      uint64_t reservedSpace2:15;
      uint64_t OPA_RANGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP1_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMOFFSETN:5;
      uint64_t reservedSpace0:3;
      uint64_t TRIMOFFSETP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP1_OTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMLPOFFSETN:5;
      uint64_t reservedSpace0:3;
      uint64_t TRIMLPOFFSETP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP1_LPOTR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPAEN:1;
      uint64_t OPALPM:1;
      uint64_t OPAMODE:2;
      uint64_t PGA_GAIN:2;
      uint64_t reservedSpace0:2;
      uint64_t VM_SEL:2;
      uint64_t VP_SEL:1;
      uint64_t reservedSpace1:1;
      uint64_t CALON:1;
      uint64_t CALSEL:1;
      uint64_t USERTRIM:1;
      uint64_t CALOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP2_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMOFFSETN:5;
      uint64_t reservedSpace0:3;
      uint64_t TRIMOFFSETP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP2_OTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMLPOFFSETN:5;
      uint64_t reservedSpace0:3;
      uint64_t TRIMLPOFFSETP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPAMP2_LPOTR;

};

#define OPAMP_0_1 (*(volatile struct OPAMP_0_1_tag *) 0x40007800)

struct FMC_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBKEN:1;
      uint64_t MUXEN:1;
      uint64_t MTYP:2;
      uint64_t MWID:2;
      uint64_t FACCEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BURSTEN:1;
      uint64_t WAITPOL:1;
      uint64_t reservedSpace1:1;
      uint64_t WAITCFG:1;
      uint64_t WREN:1;
      uint64_t WAITEN:1;
      uint64_t EXTMOD:1;
      uint64_t ASYNCWAIT:1;
      uint64_t reservedSpace2:3;
      uint64_t CBURSTRW:1;
      uint64_t CCLKEN:1;
      uint64_t WFDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t CLKDIV:4;
      uint64_t DATLAT:4;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBKEN:1;
      uint64_t MUXEN:1;
      uint64_t MTYP:2;
      uint64_t MWID:2;
      uint64_t FACCEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BURSTEN:1;
      uint64_t WAITPOL:1;
      uint64_t WRAPMOD:1;
      uint64_t WAITCFG:1;
      uint64_t WREN:1;
      uint64_t WAITEN:1;
      uint64_t EXTMOD:1;
      uint64_t ASYNCWAIT:1;
      uint64_t reservedSpace1:3;
      uint64_t CBURSTRW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t CLKDIV:4;
      uint64_t DATLAT:4;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBKEN:1;
      uint64_t MUXEN:1;
      uint64_t MTYP:2;
      uint64_t MWID:2;
      uint64_t FACCEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BURSTEN:1;
      uint64_t WAITPOL:1;
      uint64_t WRAPMOD:1;
      uint64_t WAITCFG:1;
      uint64_t WREN:1;
      uint64_t WAITEN:1;
      uint64_t EXTMOD:1;
      uint64_t ASYNCWAIT:1;
      uint64_t reservedSpace1:3;
      uint64_t CBURSTRW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t CLKDIV:4;
      uint64_t DATLAT:4;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBKEN:1;
      uint64_t MUXEN:1;
      uint64_t MTYP:2;
      uint64_t MWID:2;
      uint64_t FACCEN:1;
      uint64_t reservedSpace0:1;
      uint64_t BURSTEN:1;
      uint64_t WAITPOL:1;
      uint64_t WRAPMOD:1;
      uint64_t WAITCFG:1;
      uint64_t WREN:1;
      uint64_t WAITEN:1;
      uint64_t EXTMOD:1;
      uint64_t ASYNCWAIT:1;
      uint64_t reservedSpace1:3;
      uint64_t CBURSTRW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDSET:4;
      uint64_t ADDHLD:4;
      uint64_t DATAST:8;
      uint64_t BUSTURN:4;
      uint64_t CLKDIV:4;
      uint64_t DATLAT:4;
      uint64_t ACCMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTR4;

