iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_8;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_11;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_29;

