iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define GPIO_GROUP_INT0_0 (*(volatile struct GPIO_GROUP_INT0_0_tag *) 0x4005c000)

struct GPIO_GROUP_INT1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t COMB:1;
      uint64_t TRIG:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA1;

};

#define GPIO_GROUP_INT1_0 (*(volatile struct GPIO_GROUP_INT1_0_tag *) 0x40060000)

struct RITIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RITINT:1;
      uint64_t RITENCLR:1;
      uint64_t RITENBR:1;
      uint64_t RITEN:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOUNTER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOMP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMPVAL_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIMASK:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK_H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RICOUNTER:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER_H;

};

#define RITIMER_0 (*(volatile struct RITIMER_0_tag *) 0x40064000)

struct USB_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ADDR:7;
      uint64_t DEV_EN:1;
      uint64_t SETUP:1;
      uint64_t PLL_ON:1;
      uint64_t RESERVED_0:1;
      uint64_t LPM_SUP:1;
      uint64_t INTONNAK_AO:1;
      uint64_t INTONNAK_AI:1;
      uint64_t INTONNAK_CO:1;
      uint64_t INTONNAK_CI:1;
      uint64_t DCON:1;
      uint64_t DSUS:1;
      uint64_t RESERVED_1:1;
      uint64_t LPM_SUS:1;
      uint64_t LPM_REWP:1;
      uint64_t RESERVED_2:3;
      uint64_t DCON_C:1;
      uint64_t DSUS_C:1;
      uint64_t DRES_C:1;
      uint64_t RESERVED_3:1;
      uint64_t VBUSDEBOUNCED:1;
      uint64_t RESERVED_4:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVCMDSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_NR:11;
      uint64_t ERR_CODE:4;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:8;
      uint64_t EP_LIST:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPLISTSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:22;
      uint64_t DA_BUF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATABUFSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIRD_HW:4;
      uint64_t HIRD_SW:4;
      uint64_t DATA_PENDING:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKIP:30;
      uint64_t RESERVED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPSKIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t BUF:8;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPINUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t BUF_SB:8;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPBUFCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP0OUT:1;
      uint64_t EP0IN:1;
      uint64_t EP1OUT:1;
      uint64_t EP1IN:1;
      uint64_t EP2OUT:1;
      uint64_t EP2IN:1;
      uint64_t EP3OUT:1;
      uint64_t EP3IN:1;
      uint64_t EP4OUT:1;
      uint64_t EP4IN:1;
      uint64_t RESERVED:20;
      uint64_t FRAME_INT:1;
      uint64_t DEV_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_INT_EN:10;
      uint64_t RESERVED:20;
      uint64_t FRAME_INT_EN:1;
      uint64_t DEV_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EP_SET_INT:10;
      uint64_t RESERVED:20;
      uint64_t FRAME_SET_INT:1;
      uint64_t DEV_SET_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTSETSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROUTE_INT9_0:10;
      uint64_t RESERVED:20;
      uint64_t ROUTE_INT30:1;
      uint64_t ROUTE_INT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTROUTING;

