iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTM:2;
      uint64_t CIS:2;
      uint64_t ENCC:1;
      uint64_t SElCC:3;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

};

#define CT32B0_1 (*(volatile struct CT32B0_1_tag *) 0x40014000)

struct CT32B1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTM:2;
      uint64_t CIS:2;
      uint64_t ENCC:1;
      uint64_t SElCC:3;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

};

#define CT32B1_1 (*(volatile struct CT32B1_1_tag *) 0x40018000)

struct ADC_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:8;
      uint64_t CLKDIV:8;
      uint64_t BURST:1;
      uint64_t RESERVED_0:4;
      uint64_t RESERVED_1:1;
      uint64_t LPWRMODE:1;
      uint64_t MODE10BIT:1;
      uint64_t START:3;
      uint64_t EDGE:1;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:8;
      uint64_t CHN:3;
      uint64_t RESERVED_2:3;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GDR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADINTEN:8;
      uint64_t ADGINTEN:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t V_VREF:12;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:8;
      uint64_t OVERRUN:8;
      uint64_t ADINT:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t ADCOFFS:4;
      uint64_t TRIM:4;
      uint64_t RESERVED_1:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRM;

