iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define ADC_1_1 (*(volatile struct ADC_1_1_tag *) 0x4001c000)

struct PMU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PM:3;
      uint64_t NODPD:1;
      uint64_t RESERVED_0:4;
      uint64_t SLEEPFLAG:1;
      uint64_t RESERVED_1:2;
      uint64_t DPDFLAG:1;
      uint64_t RESERVED_2:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:10;
      uint64_t WAKEUPHYS:1;
      uint64_t GPDATA:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPREG4;

};

#define PMU_1 (*(volatile struct PMU_1_tag *) 0x40038000)

struct FLASHCTRL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHTIM:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCFG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:17;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP:17;
      uint64_t SIG_START:1;
      uint64_t RESERVED:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTOP;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW0_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW2_95_64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW3_127_96:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW3;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STARTA:14;
      uint64_t RESERVED:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEMSSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOPA:14;
      uint64_t RESERVED:16;
      uint64_t DEVSEL:1;
      uint64_t STRTBIST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEMSSTOP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_SIG:16;
      uint64_t PARITY_SIG:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EEMSSIG;

  uint8_t res3[3896];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t SIG_DONE:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTAT;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t SIG_DONE_CLR:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTATCLR;

};

#define FLASHCTRL_1 (*(volatile struct FLASHCTRL_1_tag *) 0x4003c010)

struct SSP0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:4;
      uint64_t FRF:2;
      uint64_t CPOL:1;
      uint64_t CPHA:1;
      uint64_t SCR:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBM:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPSDVSR:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

};

#define SSP0_1 (*(volatile struct SSP0_1_tag *) 0x40040000)

struct IOCON_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESET_PIO0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t RESERVED_0:5;
      uint64_t I2CMODE:2;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t reservedSpace0:5;
      uint64_t I2CMODE:2;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWCLK_PIO0_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDI_PIO0_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMS_PIO0_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDO_PIO0_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRST_PIO0_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWDIO_PIO0_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t ADMODE:1;
      uint64_t FILTR:1;
      uint64_t RESERVED_0:1;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO0_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_5;

