iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res6[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR1;

  uint8_t res7[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT1;

};

#define GPIO_PORT_1 (*(volatile struct GPIO_PORT_1_tag *) 0x50000000)

struct WWDT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDEN:1;
      uint64_t WDRESET:1;
      uint64_t WDTOF:1;
      uint64_t WDINT:1;
      uint64_t WDPROTECT:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Count:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Feed:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDFEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Count:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTV;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WARNINT:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDWARNINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDWINDOW;

};

#define WWDT_2 (*(volatile struct WWDT_2_tag *) 0x40004000)

struct CT16B0_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t CR1INT:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

