iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define IOCON_2 (*(volatile struct IOCON_2_tag *) 0x40044000)

struct SYSCON_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAP:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSMEMREMAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSP0_RST_N:1;
      uint64_t I2C_RST_N:1;
      uint64_t SSP1_RST_N:1;
      uint64_t CAN_RST_N:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSEL:5;
      uint64_t PSEL:2;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLSTAT;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t FREQRANGE:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSOSCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSEL:5;
      uint64_t FREQSEL:4;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTOSCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCCTRL;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:1;
      uint64_t EXTRST:1;
      uint64_t WDT:1;
      uint64_t BOD:1;
      uint64_t SYSRST:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRSTSTAT;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCLKUEN;

  uint8_t res3[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKUEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSAHBCLKDIV;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS:1;
      uint64_t ROM:1;
      uint64_t RAM:1;
      uint64_t FLASHREG:1;
      uint64_t FLASHARRAY:1;
      uint64_t I2C_bitfield:1;
      uint64_t GPIO:1;
      uint64_t CT16B0:1;
      uint64_t CT16B1:1;
      uint64_t CT32B0:1;
      uint64_t CT32B1_bitfield:1;
      uint64_t SSP0_bitfield:1;
      uint64_t UART:1;
      uint64_t ADC:1;
      uint64_t RESERVED_0:1;
      uint64_t WDT:1;
      uint64_t IOCON:1;
      uint64_t CAN:1;
      uint64_t SSP1_bitfield:1;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSAHBCLKCTRL;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSP0CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSP1CLKDIV;

  uint8_t res6[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLKUEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLKDIV;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTUEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTCLKDIV;

  uint8_t res8[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPPIO0_n:12;
      uint64_t CAPPIO1_n:12;
      uint64_t CAPPIO2_n:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPPIO2_8:1;
      uint64_t CAPPIO2_9:1;
      uint64_t CAPPIO2_10:1;
      uint64_t CAPPIO2_11:1;
      uint64_t CAPPIO3_0:1;
      uint64_t CAPPIO3_1:1;
      uint64_t CAPPIO3_2:1;
      uint64_t CAPPIO3_3:1;
      uint64_t CAPPIO3_4:1;
      uint64_t CAPPIO3_5:1;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP1;

  uint8_t res9[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODRSTLEV:2;
      uint64_t BODINTVAL:2;
      uint64_t BODRSTENA:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BODCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL:26;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTCKCAL;

  uint8_t res10[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQNO:5;
      uint64_t RESERVED:26;
      uint64_t NMIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMISRC;

  uint8_t res11[136];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APRPIO0_0:1;
      uint64_t APRPIO0_1:1;
      uint64_t APRPIO0_2:1;
      uint64_t APRPIO0_3:1;
      uint64_t APRPIO0_4:1;
      uint64_t APRPIO0_5:1;
      uint64_t APRPIO0_6:1;
      uint64_t APRPIO0_7:1;
      uint64_t APRPIO0_8:1;
      uint64_t APRPIO0_9:1;
      uint64_t APRPIO0_10:1;
      uint64_t APRPIO0_11:1;
      uint64_t APRPIO1_0:1;
      uint64_t RESERVED:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTAPRP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERPIO0_0:1;
      uint64_t ERPIO0_1:1;
      uint64_t ERPIO0_2:1;
      uint64_t ERPIO0_3:1;
      uint64_t ERPIO0_4:1;
      uint64_t ERPIO0_5:1;
      uint64_t ERPIO0_6:1;
      uint64_t ERPIO0_7:1;
      uint64_t ERPIO0_8:1;
      uint64_t ERPIO0_9:1;
      uint64_t ERPIO0_10:1;
      uint64_t ERPIO0_11:1;
      uint64_t ERPIO1_0:1;
      uint64_t RESERVED:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSRPIO0_0:1;
      uint64_t RSRPIO0_1:1;
      uint64_t RSRPIO0_2:1;
      uint64_t RSRPIO0_3:1;
      uint64_t RSRPIO0_4:1;
      uint64_t RSRPIO0_5:1;
      uint64_t RSRPIO0_6:1;
      uint64_t RSRPIO0_7:1;
      uint64_t RSRPIO0_8:1;
      uint64_t RSRPIO0_9:1;
      uint64_t RSRPIO0_10:1;
      uint64_t RSRPIO0_11:1;
      uint64_t RSRPIO1_0:1;
      uint64_t RESERVED:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTRSRP0CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRPIO0_0:1;
      uint64_t SRPIO0_1:1;
      uint64_t SRPIO0_2:1;
      uint64_t SRPIO0_3:1;
      uint64_t SRPIO0_4:1;
      uint64_t SRPIO0_5:1;
      uint64_t SRPIO0_6:1;
      uint64_t SRPIO0_7:1;
      uint64_t SRPIO0_8:1;
      uint64_t SRPIO0_9:1;
      uint64_t SRPIO0_10:1;
      uint64_t SRPIO0_11:1;
      uint64_t SRPIO1_0:1;
      uint64_t RESERVED:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTSRP0;

  uint8_t res12[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTUSED0:3;
      uint64_t BOD_PD:1;
      uint64_t NOTUSED1:2;
      uint64_t WDTOSC_PD:1;
      uint64_t NOTUSED2:1;
      uint64_t NOTUSED3:3;
      uint64_t NOTUSED4:2;
      uint64_t RESERVED:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRCOUT_PD:1;
      uint64_t IRC_PD:1;
      uint64_t FLASH_PD:1;
      uint64_t BOD_PD:1;
      uint64_t ADC_PD:1;
      uint64_t SYSOSC_PD:1;
      uint64_t WDTOSC_PD:1;
      uint64_t SYSPLL_PD:1;
      uint64_t NOTUSED0:1;
      uint64_t NOTUSED1:1;
      uint64_t NOTUSED2:1;
      uint64_t NOTUSED3:1;
      uint64_t NOTUSED4:1;
      uint64_t NOTUSED5:3;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDAWAKECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRCOUT_PD:1;
      uint64_t IRC_PD:1;
      uint64_t FLASH_PD:1;
      uint64_t BOD_PD:1;
      uint64_t ADC_PD:1;
      uint64_t SYSOSC_PD:1;
      uint64_t WDTOSC_PD:1;
      uint64_t SYSPLL_PD:1;
      uint64_t NOTUSED0:1;
      uint64_t NOTUSED1:1;
      uint64_t NOTUSED2:1;
      uint64_t NOTUSED3:1;
      uint64_t NOTUSED4:1;
      uint64_t NOTUSED5:3;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG;

