iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t INV:1;
      uint64_t RESERVED_0:3;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIO1_31;

};

#define IOCON_0 (*(volatile struct IOCON_0_tag *) 0x40044000)

struct SYSCON_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAP:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSMEMREMAP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSP0_RST_N:1;
      uint64_t I2C_RST_N:1;
      uint64_t SSP1_RST_N:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESETCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSEL:5;
      uint64_t PSEL:2;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSEL:5;
      uint64_t PSEL:2;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLSTAT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BYPASS:1;
      uint64_t FREQRANGE:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSOSCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSEL:5;
      uint64_t FREQSEL:4;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTOSCCTRL;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR:1;
      uint64_t EXTRST:1;
      uint64_t WDT:1;
      uint64_t BOD:1;
      uint64_t SYSRST:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSRSTSTAT;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPLLCLKSEL;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLCLKSEL;

  uint8_t res4[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAINCLKSEL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSAHBCLKDIV;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS:1;
      uint64_t ROM:1;
      uint64_t RAM0:1;
      uint64_t FLASHREG:1;
      uint64_t FLASHARRAY:1;
      uint64_t I2C_bitfield:1;
      uint64_t GPIO:1;
      uint64_t CT16B0:1;
      uint64_t CT16B1:1;
      uint64_t CT32B0:1;
      uint64_t CT32B1_bitfield:1;
      uint64_t SSP0_bitfield:1;
      uint64_t USART:1;
      uint64_t ADC:1;
      uint64_t USB:1;
      uint64_t WWDT:1;
      uint64_t IOCON:1;
      uint64_t RESERVED_0:1;
      uint64_t SSP1_bitfield:1;
      uint64_t PINT:1;
      uint64_t RESERVED_1:3;
      uint64_t GROUP0INT:1;
      uint64_t GROUP1INT:1;
      uint64_t RESERVED_2:1;
      uint64_t RAM1:1;
      uint64_t USBSRAM:1;
      uint64_t RESERVED_3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSAHBCLKCTRL;

  uint8_t res7[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSP0CLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSP1CLKDIV;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRACECLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTICKCLKDIV;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKSEL;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKDIV;

  uint8_t res11[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTSEL;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKOUTDIV;

  uint8_t res13[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIOSTAT:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIOSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIOPORCAP1;

  uint8_t res14[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BODRSTLEV:2;
      uint64_t BODINTVAL:2;
      uint64_t BODRSTENA:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BODCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL:26;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTCKCAL;

