iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:24;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_1:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS0_PACRU;

};

#define AIPS0 (*(volatile struct AIPS0_tag *) 0x40000000)

struct AIPS1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t RESERVED_1:4;
      uint64_t MPL5:1;
      uint64_t MTW5:1;
      uint64_t MTR5:1;
      uint64_t RESERVED_2:1;
      uint64_t MPL4:1;
      uint64_t MTW4:1;
      uint64_t MTR4:1;
      uint64_t RESERVED_3:1;
      uint64_t MPL3:1;
      uint64_t MTW3:1;
      uint64_t MTR3:1;
      uint64_t RESERVED_4:1;
      uint64_t MPL2:1;
      uint64_t MTW2:1;
      uint64_t MTR2:1;
      uint64_t RESERVED_5:1;
      uint64_t MPL1:1;
      uint64_t MTW1:1;
      uint64_t MTR1:1;
      uint64_t RESERVED_6:1;
      uint64_t MPL0:1;
      uint64_t MTW0:1;
      uint64_t MTR0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_MPRA;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRD;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TP7:1;
      uint64_t WP7:1;
      uint64_t SP7:1;
      uint64_t RESERVED_0:1;
      uint64_t TP6:1;
      uint64_t WP6:1;
      uint64_t SP6:1;
      uint64_t RESERVED_1:1;
      uint64_t TP5:1;
      uint64_t WP5:1;
      uint64_t SP5:1;
      uint64_t RESERVED_2:1;
      uint64_t TP4:1;
      uint64_t WP4:1;
      uint64_t SP4:1;
      uint64_t RESERVED_3:1;
      uint64_t TP3:1;
      uint64_t WP3:1;
      uint64_t SP3:1;
      uint64_t RESERVED_4:1;
      uint64_t TP2:1;
      uint64_t WP2:1;
      uint64_t SP2:1;
      uint64_t RESERVED_5:1;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_6:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRP;

