iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:24;
      uint64_t TP1:1;
      uint64_t WP1:1;
      uint64_t SP1:1;
      uint64_t RESERVED_1:1;
      uint64_t TP0:1;
      uint64_t WP0:1;
      uint64_t SP0:1;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIPS1_PACRU;

};

#define AIPS1 (*(volatile struct AIPS1_tag *) 0x40080000)

struct AXBS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t RESERVED_0:1;
      uint64_t M1:3;
      uint64_t RESERVED_1:1;
      uint64_t M2:3;
      uint64_t RESERVED_2:1;
      uint64_t M3:3;
      uint64_t RESERVED_3:1;
      uint64_t M4:3;
      uint64_t RESERVED_4:1;
      uint64_t M5:3;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:3;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:3;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_PRS0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t RESERVED_0:1;
      uint64_t PCTL:2;
      uint64_t RESERVED_1:2;
      uint64_t ARB:2;
      uint64_t RESERVED_2:20;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_CRS0;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t RESERVED_0:1;
      uint64_t M1:3;
      uint64_t RESERVED_1:1;
      uint64_t M2:3;
      uint64_t RESERVED_2:1;
      uint64_t M3:3;
      uint64_t RESERVED_3:1;
      uint64_t M4:3;
      uint64_t RESERVED_4:1;
      uint64_t M5:3;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:3;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:3;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_PRS1;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t RESERVED_0:1;
      uint64_t PCTL:2;
      uint64_t RESERVED_1:2;
      uint64_t ARB:2;
      uint64_t RESERVED_2:20;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_CRS1;

  uint8_t res3[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t RESERVED_0:1;
      uint64_t M1:3;
      uint64_t RESERVED_1:1;
      uint64_t M2:3;
      uint64_t RESERVED_2:1;
      uint64_t M3:3;
      uint64_t RESERVED_3:1;
      uint64_t M4:3;
      uint64_t RESERVED_4:1;
      uint64_t M5:3;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:3;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:3;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_PRS2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t RESERVED_0:1;
      uint64_t PCTL:2;
      uint64_t RESERVED_1:2;
      uint64_t ARB:2;
      uint64_t RESERVED_2:20;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_CRS2;

  uint8_t res5[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t RESERVED_0:1;
      uint64_t M1:3;
      uint64_t RESERVED_1:1;
      uint64_t M2:3;
      uint64_t RESERVED_2:1;
      uint64_t M3:3;
      uint64_t RESERVED_3:1;
      uint64_t M4:3;
      uint64_t RESERVED_4:1;
      uint64_t M5:3;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:3;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:3;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_PRS3;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t RESERVED_0:1;
      uint64_t PCTL:2;
      uint64_t RESERVED_1:2;
      uint64_t ARB:2;
      uint64_t RESERVED_2:20;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_CRS3;

  uint8_t res7[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t RESERVED_0:1;
      uint64_t M1:3;
      uint64_t RESERVED_1:1;
      uint64_t M2:3;
      uint64_t RESERVED_2:1;
      uint64_t M3:3;
      uint64_t RESERVED_3:1;
      uint64_t M4:3;
      uint64_t RESERVED_4:1;
      uint64_t M5:3;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:3;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:3;
      uint64_t RESERVED_9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_PRS4;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t RESERVED_0:1;
      uint64_t PCTL:2;
      uint64_t RESERVED_1:2;
      uint64_t ARB:2;
      uint64_t RESERVED_2:20;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_CRS4;

  uint8_t res9[1004];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR0;

  uint8_t res10[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR1;

  uint8_t res11[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR2;

  uint8_t res12[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR3;

  uint8_t res13[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR4;

  uint8_t res14[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AULB:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AXBS_MGPCR5;

