iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define AXBS (*(volatile struct AXBS_tag *) 0x40004000)

struct FB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t BA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSAR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V:1;
      uint64_t RESERVED_0:7;
      uint64_t WP:1;
      uint64_t RESERVED_1:7;
      uint64_t BAM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t BSTW:1;
      uint64_t BSTR:1;
      uint64_t BEM:1;
      uint64_t PS:2;
      uint64_t AA:1;
      uint64_t BLS:1;
      uint64_t WS:6;
      uint64_t WRAH:2;
      uint64_t RDAH:2;
      uint64_t ASET:2;
      uint64_t EXTS:1;
      uint64_t SWSEN:1;
      uint64_t RESERVED_1:2;
      uint64_t SWS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSCR5;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:12;
      uint64_t GROUP5:4;
      uint64_t GROUP4:4;
      uint64_t GROUP3:4;
      uint64_t GROUP2:4;
      uint64_t GROUP1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FB_CSPMCR;

};

#define FB (*(volatile struct FB_tag *) 0x4000c000)

struct MPU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t RESERVED_0:7;
      uint64_t NRGD:4;
      uint64_t NSP:4;
      uint64_t HRL:4;
      uint64_t RESERVED_1:3;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:3;
      uint64_t SPERR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CESR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR4;

