iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define MPU_1 (*(volatile struct MPU_1_tag *) 0x4000d000)

struct FMC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0AP:2;
      uint64_t M1AP:2;
      uint64_t M2AP:2;
      uint64_t M3AP:2;
      uint64_t M4AP:2;
      uint64_t M5AP:2;
      uint64_t M6AP:2;
      uint64_t M7AP:2;
      uint64_t M0PFD:1;
      uint64_t M1PFD:1;
      uint64_t M2PFD:1;
      uint64_t M3PFD:1;
      uint64_t M4PFD:1;
      uint64_t M5PFD:1;
      uint64_t M6PFD:1;
      uint64_t M7PFD:1;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_PFAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0SEBE:1;
      uint64_t B0IPE:1;
      uint64_t B0DPE:1;
      uint64_t B0ICE:1;
      uint64_t B0DCE:1;
      uint64_t CRC:3;
      uint64_t RESERVED_0:8;
      uint64_t RESERVED_1:1;
      uint64_t B0MW:2;
      uint64_t S_B_INV:1;
      uint64_t CINV_WAY:4;
      uint64_t CLCK_WAY:4;
      uint64_t B0RWSC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_PFB0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B1SEBE:1;
      uint64_t B1IPE:1;
      uint64_t B1DPE:1;
      uint64_t B1ICE:1;
      uint64_t B1DCE:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:8;
      uint64_t RESERVED_2:1;
      uint64_t B1MW:2;
      uint64_t RESERVED_3:9;
      uint64_t B1RWSC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_PFB1CR;

  uint8_t res0[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW0S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW0S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW0S2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW0S3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW1S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW1S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW1S2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW1S3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW2S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW2S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW2S2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW2S3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW3S0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW3S1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW3S2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t valid:1;
      uint64_t RESERVED_0:4;
      uint64_t tag:14;
      uint64_t RESERVED_1:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_TAGVDW3S3;

  uint8_t res1[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S0U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S1U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S2U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S3U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW0S3L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S0U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S1U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S2U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S3U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW1S3L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S0U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S1U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S2U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S3U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW2S3L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S0U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S0L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S1U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S2U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S2L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S3U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_DATAW3S3L;

