iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define FMC_1 (*(volatile struct FMC_1_tag *) 0x4001f000)

struct FTFE_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t MGSTAT0:1;
      uint64_t RESERVED:3;
      uint64_t FPVIOL:1;
      uint64_t ACCERR:1;
      uint64_t RDCOLERR:1;
      uint64_t CCIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FSTAT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EEERDY:1;
      uint64_t RAMRDY:1;
      uint64_t PFLSH:1;
      uint64_t SWAP:1;
      uint64_t ERSSUSP:1;
      uint64_t ERSAREQ:1;
      uint64_t RDCOLLIE:1;
      uint64_t CCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCNFG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEC:2;
      uint64_t FSLACC:2;
      uint64_t MEEN:2;
      uint64_t KEYEN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FSEC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OPT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FOPT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOBB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOBA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCOBn:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FCCOB8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FPROT3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FPROT2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FPROT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FPROT0;

  uint8_t res0[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FEPROT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DPROT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FTFE_FDPROT;

};

#define FTFE (*(volatile struct FTFE_tag *) 0x40020000)

struct DMAMUX_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAMUX_CHCFG15;

