iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define DMAMUX (*(volatile struct DMAMUX_tag *) 0x40021000)

struct CAN0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXMB:7;
      uint64_t RESERVED_0:1;
      uint64_t IDAM:2;
      uint64_t RESERVED_1:2;
      uint64_t AEN:1;
      uint64_t LPRIOEN:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t IRMQ:1;
      uint64_t SRXDIS:1;
      uint64_t RESERVED_4:1;
      uint64_t WAKSRC:1;
      uint64_t LPMACK:1;
      uint64_t WRNEN:1;
      uint64_t SLFWAK:1;
      uint64_t SUPV:1;
      uint64_t FRZACK:1;
      uint64_t SOFTRST:1;
      uint64_t WAKMSK:1;
      uint64_t NOTRDY:1;
      uint64_t HALT:1;
      uint64_t RFEN:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROPSEG:3;
      uint64_t LOM:1;
      uint64_t LBUF:1;
      uint64_t TSYN:1;
      uint64_t BOFFREC:1;
      uint64_t SMP:1;
      uint64_t RESERVED:2;
      uint64_t RWRNMSK:1;
      uint64_t TWRNMSK:1;
      uint64_t LPB:1;
      uint64_t CLKSRC:1;
      uint64_t ERRMSK:1;
      uint64_t BOFFMSK:1;
      uint64_t PSEG2:3;
      uint64_t PSEG1:3;
      uint64_t RJW:2;
      uint64_t PRESDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_TIMER;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXMGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX14M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RX14MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX15M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RX15MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXERRCNT:8;
      uint64_t RXERRCNT:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKINT:1;
      uint64_t ERRINT:1;
      uint64_t BOFFINT:1;
      uint64_t RX:1;
      uint64_t FLTCONF:2;
      uint64_t TX:1;
      uint64_t IDLE:1;
      uint64_t RXWRN:1;
      uint64_t TXWRN:1;
      uint64_t STFERR:1;
      uint64_t FRMERR:1;
      uint64_t CRCERR:1;
      uint64_t ACKERR:1;
      uint64_t BIT0ERR:1;
      uint64_t BIT1ERR:1;
      uint64_t RWRNINT:1;
      uint64_t TWRNINT:1;
      uint64_t SYNCH:1;
      uint64_t RESERVED:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ESR1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUFLM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IMASK1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF0I:1;
      uint64_t BUF4TO1I:4;
      uint64_t BUF5I:1;
      uint64_t BUF6I:1;
      uint64_t BUF7I:1;
      uint64_t BUF31TO8I:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IFLAG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t EACEN:1;
      uint64_t RRS:1;
      uint64_t MRP:1;
      uint64_t TASD:5;
      uint64_t RFFN:4;
      uint64_t WRMFRZ:1;
      uint64_t RESERVED_1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:13;
      uint64_t IMB:1;
      uint64_t VPS:1;
      uint64_t RESERVED_1:1;
      uint64_t LPTM:7;
      uint64_t RESERVED_2:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ESR2;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCRC:15;
      uint64_t RESERVED_0:1;
      uint64_t MBCRC:7;
      uint64_t RESERVED_1:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FGM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXFGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDHIT:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXFIR;

  uint8_t res4[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD010;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD011;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD012;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD013;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD014;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIME_STAMP:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
      uint64_t RESERVED_0:1;
      uint64_t CODE:4;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CS15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT:18;
      uint64_t STD:11;
      uint64_t PRIO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ID15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD015;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_7:8;
      uint64_t DATA_BYTE_6:8;
      uint64_t DATA_BYTE_5:8;
      uint64_t DATA_BYTE_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_WORD115;

  uint8_t res5[1792];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR13;

