iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXIMR15;

};

#define CAN0 (*(volatile struct CAN0_tag *) 0x40024000)

struct RNG_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GO:1;
      uint64_t HA:1;
      uint64_t INTM:1;
      uint64_t CLRI:1;
      uint64_t SLP:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RNG_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECV:1;
      uint64_t LRS:1;
      uint64_t ORU:1;
      uint64_t ERRI:1;
      uint64_t SLP:1;
      uint64_t RESERVED_0:3;
      uint64_t OREG_LVL:8;
      uint64_t OREG_SIZE:8;
      uint64_t RESERVED_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RNG_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT_ENT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RNG_ER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANDOUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RNG_OR;

};

#define RNG_1 (*(volatile struct RNG_1_tag *) 0x40029000)

struct I2S0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:3;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t RESERVED_2:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t RESERVED_3:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t RESERVED_4:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t STOPE:1;
      uint64_t TE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFW:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:16;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t BCS:1;
      uint64_t SYNC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:5;
      uint64_t RESERVED_0:11;
      uint64_t TCE:2;
      uint64_t RESERVED_1:6;
      uint64_t RESERVED_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t RESERVED_0:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t RESERVED_1:3;
      uint64_t SYWD:5;
      uint64_t RESERVED_2:3;
      uint64_t FRSZ:5;
      uint64_t RESERVED_3:3;
      uint64_t RESERVED_4:2;
      uint64_t RESERVED_5:2;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:8;
      uint64_t FBT:5;
      uint64_t RESERVED_1:3;
      uint64_t W0W:5;
      uint64_t RESERVED_2:3;
      uint64_t WNW:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TCR5;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TDR1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t RESERVED_0:12;
      uint64_t WFP:4;
      uint64_t RESERVED_1:11;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t RESERVED_0:12;
      uint64_t WFP:4;
      uint64_t RESERVED_1:11;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TFR1;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_TMR;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:3;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t RESERVED_2:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t RESERVED_3:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t RESERVED_4:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t STOPE:1;
      uint64_t RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFW:3;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t RESERVED:16;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t BCS:1;
      uint64_t SYNC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:5;
      uint64_t RESERVED_0:11;
      uint64_t RCE:2;
      uint64_t RESERVED_1:6;
      uint64_t RESERVED_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t RESERVED_0:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t RESERVED_1:3;
      uint64_t SYWD:5;
      uint64_t RESERVED_2:3;
      uint64_t FRSZ:5;
      uint64_t RESERVED_3:3;
      uint64_t RESERVED_4:2;
      uint64_t RESERVED_5:2;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:8;
      uint64_t FBT:5;
      uint64_t RESERVED_1:3;
      uint64_t W0W:5;
      uint64_t RESERVED_2:3;
      uint64_t WNW:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RCR5;

