iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RDR1;

  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t RESERVED_0:11;
      uint64_t RESERVED_1:1;
      uint64_t WFP:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t RESERVED_0:11;
      uint64_t RESERVED_1:1;
      uint64_t WFP:4;
      uint64_t RESERVED_2:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RFR1;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_RMR;

  uint8_t res7[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:24;
      uint64_t MICS:2;
      uint64_t RESERVED_1:4;
      uint64_t MOE:1;
      uint64_t DUF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVIDE:12;
      uint64_t FRACT:8;
      uint64_t RESERVED:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2S0_MDR;

};

#define I2S0 (*(volatile struct I2S0_tag *) 0x4002f000)

struct PDB0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDOK:1;
      uint64_t CONT:1;
      uint64_t MULT:2;
      uint64_t RESERVED_0:1;
      uint64_t PDBIE:1;
      uint64_t PDBIF:1;
      uint64_t PDBEN:1;
      uint64_t TRGSEL:4;
      uint64_t PRESCALER:3;
      uint64_t DMAEN:1;
      uint64_t SWTRIG:1;
      uint64_t PDBEIE:1;
      uint64_t LDMOD:2;
      uint64_t RESERVED_1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDLY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_IDLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:8;
      uint64_t TOS:8;
      uint64_t BB:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH0C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:8;
      uint64_t RESERVED_0:8;
      uint64_t CF:8;
      uint64_t RESERVED_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH0S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH0DLY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH0DLY1;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:8;
      uint64_t TOS:8;
      uint64_t BB:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH1C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERR:8;
      uint64_t RESERVED_0:8;
      uint64_t CF:8;
      uint64_t RESERVED_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH1DLY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_CH1DLY1;

  uint8_t res1[264];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOE:1;
      uint64_t EXT:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_DACINTC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_DACINT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOE:1;
      uint64_t EXT:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_DACINTC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_DACINT1;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POEN:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_POEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY2:16;
      uint64_t DLY1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_PO0DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY2:16;
      uint64_t DLY1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_PO1DLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY2:16;
      uint64_t DLY1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDB0_PO2DLY;

};

#define PDB0 (*(volatile struct PDB0_tag *) 0x40036000)

struct PIT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_MCR;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_LDVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_CVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TFLG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_LDVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_CVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TFLG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_LDVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_CVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TFLG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_LDVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_CVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIT_TFLG3;

