iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define FTM2 (*(volatile struct FTM2_tag *) 0x4003a000)

struct FTM3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:3;
      uint64_t CLKS:2;
      uint64_t CPWMS:1;
      uint64_t TOIE:1;
      uint64_t TOF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C0SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C0V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C1SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C1V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C2SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C2V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C3SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C3V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C4SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C4V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C5SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C5V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C6SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C6V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED_0:1;
      uint64_t ELSA:1;
      uint64_t ELSB:1;
      uint64_t MSA:1;
      uint64_t MSB:1;
      uint64_t CHIE:1;
      uint64_t CHF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C7SC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_C7V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_CNTIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t CH6F:1;
      uint64_t CH7F:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTMEN:1;
      uint64_t INIT:1;
      uint64_t WPDIS:1;
      uint64_t PWMSYNC:1;
      uint64_t CAPTEST:1;
      uint64_t FAULTM:2;
      uint64_t FAULTIE:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTMIN:1;
      uint64_t CNTMAX:1;
      uint64_t REINIT:1;
      uint64_t SYNCHOM:1;
      uint64_t TRIG0:1;
      uint64_t TRIG1:1;
      uint64_t TRIG2:1;
      uint64_t SWSYNC:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0OI:1;
      uint64_t CH1OI:1;
      uint64_t CH2OI:1;
      uint64_t CH3OI:1;
      uint64_t CH4OI:1;
      uint64_t CH5OI:1;
      uint64_t CH6OI:1;
      uint64_t CH7OI:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_OUTINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0OM:1;
      uint64_t CH1OM:1;
      uint64_t CH2OM:1;
      uint64_t CH3OM:1;
      uint64_t CH4OM:1;
      uint64_t CH5OM:1;
      uint64_t CH6OM:1;
      uint64_t CH7OM:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_OUTMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMBINE0:1;
      uint64_t COMP0:1;
      uint64_t DECAPEN0:1;
      uint64_t DECAP0:1;
      uint64_t DTEN0:1;
      uint64_t SYNCEN0:1;
      uint64_t FAULTEN0:1;
      uint64_t RESERVED_0:1;
      uint64_t COMBINE1:1;
      uint64_t COMP1:1;
      uint64_t DECAPEN1:1;
      uint64_t DECAP1:1;
      uint64_t DTEN1:1;
      uint64_t SYNCEN1:1;
      uint64_t FAULTEN1:1;
      uint64_t RESERVED_1:1;
      uint64_t COMBINE2:1;
      uint64_t COMP2:1;
      uint64_t DECAPEN2:1;
      uint64_t DECAP2:1;
      uint64_t DTEN2:1;
      uint64_t SYNCEN2:1;
      uint64_t FAULTEN2:1;
      uint64_t RESERVED_2:1;
      uint64_t COMBINE3:1;
      uint64_t COMP3:1;
      uint64_t DECAPEN3:1;
      uint64_t DECAP3:1;
      uint64_t DTEN3:1;
      uint64_t SYNCEN3:1;
      uint64_t FAULTEN3:1;
      uint64_t RESERVED_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_COMBINE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTVAL:6;
      uint64_t DTPS:2;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_DEADTIME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH2TRIG:1;
      uint64_t CH3TRIG:1;
      uint64_t CH4TRIG:1;
      uint64_t CH5TRIG:1;
      uint64_t CH0TRIG:1;
      uint64_t CH1TRIG:1;
      uint64_t INITTRIGEN:1;
      uint64_t TRIGF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_EXTTRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL0:1;
      uint64_t POL1:1;
      uint64_t POL2:1;
      uint64_t POL3:1;
      uint64_t POL4:1;
      uint64_t POL5:1;
      uint64_t POL6:1;
      uint64_t POL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_POL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAULTF0:1;
      uint64_t FAULTF1:1;
      uint64_t FAULTF2:1;
      uint64_t FAULTF3:1;
      uint64_t RESERVED_0:1;
      uint64_t FAULTIN:1;
      uint64_t WPEN:1;
      uint64_t FAULTF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_FMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0FVAL:4;
      uint64_t CH1FVAL:4;
      uint64_t CH2FVAL:4;
      uint64_t CH3FVAL:4;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAULT0EN:1;
      uint64_t FAULT1EN:1;
      uint64_t FAULT2EN:1;
      uint64_t FAULT3EN:1;
      uint64_t FFLTR0EN:1;
      uint64_t FFLTR1EN:1;
      uint64_t FFLTR2EN:1;
      uint64_t FFLTR3EN:1;
      uint64_t FFVAL:4;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_FLTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUADEN:1;
      uint64_t TOFDIR:1;
      uint64_t QUADIR:1;
      uint64_t QUADMODE:1;
      uint64_t PHBPOL:1;
      uint64_t PHAPOL:1;
      uint64_t PHBFLTREN:1;
      uint64_t PHAFLTREN:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_QDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMTOF:5;
      uint64_t RESERVED_0:1;
      uint64_t BDMMODE:2;
      uint64_t RESERVED_1:1;
      uint64_t GTBEEN:1;
      uint64_t GTBEOUT:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT0POL:1;
      uint64_t FLT1POL:1;
      uint64_t FLT2POL:1;
      uint64_t FLT3POL:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_FLTPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWTRIGMODE:1;
      uint64_t RESERVED_0:1;
      uint64_t CNTINC:1;
      uint64_t RESERVED_1:1;
      uint64_t INVC:1;
      uint64_t SWOC:1;
      uint64_t RESERVED_2:1;
      uint64_t SYNCMODE:1;
      uint64_t SWRSTCNT:1;
      uint64_t SWWRBUF:1;
      uint64_t SWOM:1;
      uint64_t SWINVC:1;
      uint64_t SWSOC:1;
      uint64_t RESERVED_3:3;
      uint64_t HWRSTCNT:1;
      uint64_t HWWRBUF:1;
      uint64_t HWOM:1;
      uint64_t HWINVC:1;
      uint64_t HWSOC:1;
      uint64_t RESERVED_4:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_SYNCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INV0EN:1;
      uint64_t INV1EN:1;
      uint64_t INV2EN:1;
      uint64_t INV3EN:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_INVCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0OC:1;
      uint64_t CH1OC:1;
      uint64_t CH2OC:1;
      uint64_t CH3OC:1;
      uint64_t CH4OC:1;
      uint64_t CH5OC:1;
      uint64_t CH6OC:1;
      uint64_t CH7OC:1;
      uint64_t CH0OCV:1;
      uint64_t CH1OCV:1;
      uint64_t CH2OCV:1;
      uint64_t CH3OCV:1;
      uint64_t CH4OCV:1;
      uint64_t CH5OCV:1;
      uint64_t CH6OCV:1;
      uint64_t CH7OCV:1;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_SWOCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0SEL:1;
      uint64_t CH1SEL:1;
      uint64_t CH2SEL:1;
      uint64_t CH3SEL:1;
      uint64_t CH4SEL:1;
      uint64_t CH5SEL:1;
      uint64_t CH6SEL:1;
      uint64_t CH7SEL:1;
      uint64_t RESERVED_0:1;
      uint64_t LDOK:1;
      uint64_t RESERVED_1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM3_PWMLOAD;

