iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define FTM3 (*(volatile struct FTM3_tag *) 0x400b9000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t ADLSMP:1;
      uint64_t ADIV:2;
      uint64_t ADLPC:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADLSTS:2;
      uint64_t ADHSC:1;
      uint64_t ADACKEN:1;
      uint64_t MUXSEL:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t RESERVED_0:2;
      uint64_t CALF:1;
      uint64_t CAL:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_PG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MG:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_MG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPD:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP4:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:7;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMD:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM4:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM3:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM2:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM1:7;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM0:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLM0;

};

#define ADC0 (*(volatile struct ADC0_tag *) 0x4003b000)

struct ADC1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:5;
      uint64_t DIFF:1;
      uint64_t AIEN:1;
      uint64_t COCO:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t ADLSMP:1;
      uint64_t ADIV:2;
      uint64_t ADLPC:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADLSTS:2;
      uint64_t ADHSC:1;
      uint64_t ADACKEN:1;
      uint64_t MUXSEL:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t RESERVED_0:2;
      uint64_t CALF:1;
      uint64_t CAL:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_PG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MG:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_MG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPD:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP4:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:7;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLP0;

