iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMD:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLMS:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM4:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM3:9;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM2:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM1:7;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLM0:6;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC1_CLM0;

};

#define ADC1_1 (*(volatile struct ADC1_1_tag *) 0x400bb000)

struct RTC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPR:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:8;
      uint64_t CIR:8;
      uint64_t TCV:8;
      uint64_t CIC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t WPE:1;
      uint64_t SUP:1;
      uint64_t UM:1;
      uint64_t WPS:1;
      uint64_t RESERVED_0:3;
      uint64_t OSCE:1;
      uint64_t CLKO:1;
      uint64_t SC16P:1;
      uint64_t SC8P:1;
      uint64_t SC4P:1;
      uint64_t SC2P:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t TOF:1;
      uint64_t TAF:1;
      uint64_t RESERVED_0:1;
      uint64_t TCE:1;
      uint64_t RESERVED_1:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t TCL:1;
      uint64_t CRL:1;
      uint64_t SRL:1;
      uint64_t LRL:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIIE:1;
      uint64_t TOIE:1;
      uint64_t TAIE:1;
      uint64_t RESERVED_0:1;
      uint64_t TSIE:1;
      uint64_t RESERVED_1:2;
      uint64_t WPON:1;
      uint64_t RESERVED_2:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_IER;

  uint8_t res0[2016];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSRW:1;
      uint64_t TPRW:1;
      uint64_t TARW:1;
      uint64_t TCRW:1;
      uint64_t CRW:1;
      uint64_t SRW:1;
      uint64_t LRW:1;
      uint64_t IERW:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_WAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSRR:1;
      uint64_t TPRR:1;
      uint64_t TARR:1;
      uint64_t TCRR:1;
      uint64_t CRR:1;
      uint64_t SRR:1;
      uint64_t LRR:1;
      uint64_t IERR:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_RAR;

};

#define RTC_2 (*(volatile struct RTC_2_tag *) 0x4003d000)

struct RFVBAT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFVBAT_REG7;

};

#define RFVBAT (*(volatile struct RFVBAT_tag *) 0x4003e000)

struct LPTMR0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TMS:1;
      uint64_t TFC:1;
      uint64_t TPP:1;
      uint64_t TPS:2;
      uint64_t TIE:1;
      uint64_t TCF:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:2;
      uint64_t PBYP:1;
      uint64_t PRESCALE:4;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPARE:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CNR;

