iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define LPTMR0 (*(volatile struct LPTMR0_tag *) 0x40040000)

struct RFSYS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LL:8;
      uint64_t LH:8;
      uint64_t HL:8;
      uint64_t HH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFSYS_REG7;

};

#define RFSYS (*(volatile struct RFSYS_tag *) 0x40041000)

struct SIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t RESERVED_1:6;
      uint64_t RAMSIZE:4;
      uint64_t RESERVED_2:2;
      uint64_t OSC32KSEL:2;
      uint64_t RESERVED_3:9;
      uint64_t USBVSTBY:1;
      uint64_t USBSSTBY:1;
      uint64_t USBREGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:8;
      uint64_t RESERVED_1:2;
      uint64_t RESERVED_2:14;
      uint64_t URWE:1;
      uint64_t UVSWE:1;
      uint64_t USSWE:1;
      uint64_t RESERVED_3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT1CFG;

  uint8_t res0[4092];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t RTCCLKOUTSEL:1;
      uint64_t CLKOUTSEL:3;
      uint64_t FBSL:2;
      uint64_t RESERVED_1:1;
      uint64_t PTD7PAD:1;
      uint64_t TRACECLKSEL:1;
      uint64_t RESERVED_2:3;
      uint64_t PLLFLLSEL:2;
      uint64_t USBSRC:1;
      uint64_t RMIISRC:1;
      uint64_t TIMESRC:2;
      uint64_t RESERVED_3:2;
      uint64_t RESERVED_4:2;
      uint64_t RESERVED_5:2;
      uint64_t SDHCSRC:2;
      uint64_t RESERVED_6:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTM0FLT0:1;
      uint64_t FTM0FLT1:1;
      uint64_t FTM0FLT2:1;
      uint64_t RESERVED_0:1;
      uint64_t FTM1FLT0:1;
      uint64_t RESERVED_1:3;
      uint64_t FTM2FLT0:1;
      uint64_t RESERVED_2:3;
      uint64_t FTM3FLT0:1;
      uint64_t RESERVED_3:5;
      uint64_t FTM1CH0SRC:2;
      uint64_t FTM2CH0SRC:2;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t FTM0CLKSEL:1;
      uint64_t FTM1CLKSEL:1;
      uint64_t FTM2CLKSEL:1;
      uint64_t FTM3CLKSEL:1;
      uint64_t FTM0TRG0SRC:1;
      uint64_t FTM0TRG1SRC:1;
      uint64_t FTM3TRG0SRC:1;
      uint64_t FTM3TRG1SRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART0TXSRC:2;
      uint64_t UART0RXSRC:2;
      uint64_t UART1TXSRC:2;
      uint64_t UART1RXSRC:2;
      uint64_t RESERVED_0:8;
      uint64_t RESERVED_1:2;
      uint64_t RESERVED_2:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT5;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0TRGSEL:4;
      uint64_t ADC0PRETRGSEL:1;
      uint64_t RESERVED_0:2;
      uint64_t ADC0ALTTRGEN:1;
      uint64_t ADC1TRGSEL:4;
      uint64_t ADC1PRETRGSEL:1;
      uint64_t RESERVED_1:2;
      uint64_t ADC1ALTTRGEN:1;
      uint64_t RESERVED_2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SOPT7;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINID:4;
      uint64_t FAMID:3;
      uint64_t DIEID:5;
      uint64_t REVID:4;
      uint64_t RESERVED:4;
      uint64_t SERIESID:4;
      uint64_t SUBFAMID:4;
      uint64_t FAMILYID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SDID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t I2C2:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:2;
      uint64_t UART4:1;
      uint64_t UART5:1;
      uint64_t RESERVED_3:9;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:2;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENET_bitfield:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:5;
      uint64_t RESERVED_2:3;
      uint64_t DAC0_bitfield:1;
      uint64_t DAC1_bitfield:1;
      uint64_t RESERVED_3:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RNGA:1;
      uint64_t RESERVED_0:3;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:7;
      uint64_t SPI2:1;
      uint64_t RESERVED_3:4;
      uint64_t SDHC_bitfield:1;
      uint64_t RESERVED_4:6;
      uint64_t FTM2_bitfield:1;
      uint64_t FTM3_bitfield:1;
      uint64_t RESERVED_5:1;
      uint64_t ADC1:1;
      uint64_t RESERVED_6:2;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t EWM_bitfield:1;
      uint64_t CMT_bitfield:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:2;
      uint64_t I2C0_bitfield:1;
      uint64_t I2C1:1;
      uint64_t RESERVED_3:2;
      uint64_t UART0:1;
      uint64_t UART1_bitfield:1;
      uint64_t UART2_bitfield:1;
      uint64_t UART3_bitfield:1;
      uint64_t RESERVED_4:4;
      uint64_t USBOTG:1;
      uint64_t CMP:1;
      uint64_t VREF_bitfield:1;
      uint64_t RESERVED_5:7;
      uint64_t RESERVED_6:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPTMR:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:2;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:2;
      uint64_t PORTA_bitfield:1;
      uint64_t PORTB_bitfield:1;
      uint64_t PORTC_bitfield:1;
      uint64_t PORTD_bitfield:1;
      uint64_t PORTE_bitfield:1;
      uint64_t RESERVED_6:4;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTF:1;
      uint64_t DMAMUX_bitfield:1;
      uint64_t RESERVED_0:2;
      uint64_t FLEXCAN0:1;
      uint64_t RESERVED_1:4;
      uint64_t RNGA:1;
      uint64_t RESERVED_2:2;
      uint64_t SPI0:1;
      uint64_t SPI1:1;
      uint64_t RESERVED_3:1;
      uint64_t I2S:1;
      uint64_t RESERVED_4:2;
      uint64_t CRC:1;
      uint64_t RESERVED_5:2;
      uint64_t USBDCD:1;
      uint64_t PDB:1;
      uint64_t PIT_bitfield:1;
      uint64_t FTM0_bitfield:1;
      uint64_t FTM1_bitfield:1;
      uint64_t FTM2_bitfield:1;
      uint64_t ADC0_bitfield:1;
      uint64_t RESERVED_6:1;
      uint64_t RTC:1;
      uint64_t RESERVED_7:1;
      uint64_t DAC0_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXBUS:1;
      uint64_t DMA:1;
      uint64_t MPU:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SCGC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:16;
      uint64_t OUTDIV4:4;
      uint64_t OUTDIV3:4;
      uint64_t OUTDIV2:4;
      uint64_t OUTDIV1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_CLKDIV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBFRAC:1;
      uint64_t USBDIV:3;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_CLKDIV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHDIS:1;
      uint64_t FLASHDOZE:1;
      uint64_t RESERVED_0:6;
      uint64_t DEPART:4;
      uint64_t RESERVED_1:4;
      uint64_t EESIZE:4;
      uint64_t RESERVED_2:4;
      uint64_t PFSIZE:4;
      uint64_t NVMSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_FCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t MAXADDR1:7;
      uint64_t PFLSH:1;
      uint64_t MAXADDR0:7;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_FCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDMH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDL;

