iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define SIM (*(volatile struct SIM_tag *) 0x40047000)

struct PORTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GPCHR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_ISFR;

