iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define PORTB (*(volatile struct PORTB_tag *) 0x4004a000)

struct PORTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t SRE:1;
      uint64_t RESERVED_0:1;
      uint64_t PFE:1;
      uint64_t ODE:1;
      uint64_t DSE:1;
      uint64_t RESERVED_1:1;
      uint64_t MUX:3;
      uint64_t RESERVED_2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t RESERVED_3:4;
      uint64_t ISF:1;
      uint64_t RESERVED_4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_PCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_GPCHR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTC_ISFR;

