iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define PORTE (*(volatile struct PORTE_tag *) 0x4004d000)

struct WDOG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t WDOGEN:1;
      uint64_t CLKSRC:1;
      uint64_t IRQRSTEN:1;
      uint64_t WINEN:1;
      uint64_t ALLOWUPDATE:1;
      uint64_t DBGEN:1;
      uint64_t STOPEN:1;
      uint64_t WAITEN:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t TESTWDOG:1;
      uint64_t TESTSEL:1;
      uint64_t BYTESEL:2;
      uint64_t DISTESTWDOG:1;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_STCTRLH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESERVED:15;
      uint64_t INTFLG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_STCTRLL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TOVALHIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_TOVALH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TOVALLOW:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_TOVALL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WINHIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_WINH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WINLOW:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_WINL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WDOGREFRESH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_REFRESH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WDOGUNLOCK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_UNLOCK;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIMEROUTHIGH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_TMROUTH;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIMEROUTLOW:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_TMROUTL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RSTCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_RSTCNT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESERVED_0:8;
      uint64_t PRESCVAL:3;
      uint64_t RESERVED_1:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WDOG_PRESC;

};

#define WDOG (*(volatile struct WDOG_tag *) 0x40052000)

struct EWM_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t EWMEN:1;
      uint64_t ASSIN:1;
      uint64_t INEN:1;
      uint64_t INTEN:1;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SERVICE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_SERV;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPAREL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CMPL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPAREH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWM_CMPH;

};

#define EWM (*(volatile struct EWM_tag *) 0x40061000)

struct CMT_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CGH1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CGL1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CGH2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CGL2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:5;
      uint64_t IROPEN:1;
      uint64_t CMTPOL:1;
      uint64_t IROL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_OC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCGEN:1;
      uint64_t EOCIE:1;
      uint64_t FSK:1;
      uint64_t BASE:1;
      uint64_t EXSPC:1;
      uint64_t CMTDIV:2;
      uint64_t EOCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_MSC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CMD1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CMD2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CMD3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_CMD4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PPSDIV:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_PPS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DMA:1;
      uint64_t RESERVED:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMT_DMA;

};

#define CMT (*(volatile struct CMT_tag *) 0x40062000)

struct MCG_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t IREFSTEN:1;
      uint64_t IRCLKEN:1;
      uint64_t IREFS:1;
      uint64_t FRDIV:3;
      uint64_t CLKS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IRCS:1;
      uint64_t LP:1;
      uint64_t EREFS:1;
      uint64_t HGO:1;
      uint64_t RANGE:2;
      uint64_t FCFTRIM:1;
      uint64_t LOCRE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCTRIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCFTRIM:1;
      uint64_t FCTRIM:4;
      uint64_t DRST_DRS:2;
      uint64_t DMX32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRDIV0:5;
      uint64_t PLLSTEN0:1;
      uint64_t PLLCLKEN0:1;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VDIV0:5;
      uint64_t CME0:1;
      uint64_t PLLS:1;
      uint64_t LOLIE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IRCST:1;
      uint64_t OSCINIT0:1;
      uint64_t CLKST:2;
      uint64_t IREFST:1;
      uint64_t PLLST:1;
      uint64_t LOCK0:1;
      uint64_t LOLS0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_S;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOCS0:1;
      uint64_t FCRDIV:3;
      uint64_t FLTPRSRV:1;
      uint64_t ATMF:1;
      uint64_t ATMS:1;
      uint64_t ATME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_SC;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ATCVH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_ATCVH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ATCVL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_ATCVL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OSCSEL:2;
      uint64_t RESERVED_0:4;
      uint64_t RESERVED_1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOCS1:1;
      uint64_t RESERVED:4;
      uint64_t CME1:1;
      uint64_t LOLRE:1;
      uint64_t LOCRE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCG_C8;

