iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define MCG (*(volatile struct MCG_tag *) 0x40064000)

struct OSC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SC16P:1;
      uint64_t SC8P:1;
      uint64_t SC4P:1;
      uint64_t SC2P:1;
      uint64_t RESERVED_0:1;
      uint64_t EREFSTEN:1;
      uint64_t RESERVED_1:1;
      uint64_t ERCLKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSC_CR;

};

#define OSC (*(volatile struct OSC_tag *) 0x40065000)

struct I2C0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:4;
      uint64_t STARTF:1;
      uint64_t SSIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_RA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SHTF2IE:1;
      uint64_t SHTF2:1;
      uint64_t SHTF1:1;
      uint64_t SLTF:1;
      uint64_t TCKSEL:1;
      uint64_t SIICAEN:1;
      uint64_t ALERTEN:1;
      uint64_t FACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_SMB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t SAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_A2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_SLTH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C0_SLTL;

};

#define I2C0 (*(volatile struct I2C0_tag *) 0x40066000)

struct I2C1_2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:4;
      uint64_t STARTF:1;
      uint64_t SSIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_RA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SHTF2IE:1;
      uint64_t SHTF2:1;
      uint64_t SHTF1:1;
      uint64_t SLTF:1;
      uint64_t TCKSEL:1;
      uint64_t SIICAEN:1;
      uint64_t ALERTEN:1;
      uint64_t FACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_SMB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t SAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_A2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_SLTH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C1_SLTL;

};

#define I2C1_2 (*(volatile struct I2C1_2_tag *) 0x40067000)

struct I2C2_2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t AD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_A1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ICR:6;
      uint64_t MULT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_F;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t WUEN:1;
      uint64_t RSTA:1;
      uint64_t TXAK:1;
      uint64_t TX:1;
      uint64_t MST:1;
      uint64_t IICIE:1;
      uint64_t IICEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXAK:1;
      uint64_t IICIF:1;
      uint64_t SRW:1;
      uint64_t RAM:1;
      uint64_t ARBL:1;
      uint64_t BUSY:1;
      uint64_t IAAS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_S;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:3;
      uint64_t RMEN:1;
      uint64_t SBRC:1;
      uint64_t HDRS:1;
      uint64_t ADEXT:1;
      uint64_t GCAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FLT:4;
      uint64_t STARTF:1;
      uint64_t SSIE:1;
      uint64_t STOPF:1;
      uint64_t SHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_FLT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t RAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_RA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SHTF2IE:1;
      uint64_t SHTF2:1;
      uint64_t SHTF1:1;
      uint64_t SLTF:1;
      uint64_t TCKSEL:1;
      uint64_t SIICAEN:1;
      uint64_t ALERTEN:1;
      uint64_t FACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_SMB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t SAD:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_A2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_SLTH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSLT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) I2C2_SLTL;

