iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define I2C2_2 (*(volatile struct I2C2_2_tag *) 0x400e6000)

struct UART1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:5;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_BDH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_BDL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t UARTSWAI:1;
      uint64_t LOOPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_S1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_S2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t T8:1;
      uint64_t R8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_MA1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_MA2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BRFA:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:3;
      uint64_t LBKDDMAS:1;
      uint64_t ILDMAS:1;
      uint64_t RDMAS:1;
      uint64_t TCDMAS:1;
      uint64_t TDMAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_C5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:6;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_ED;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_MODEM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNP:2;
      uint64_t IREN:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_IR;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_PFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXOFE:1;
      uint64_t RESERVED:3;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_CFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t RXOF:1;
      uint64_t RESERVED:3;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_SFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_TWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_TCFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_RWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART1_RCFIFO;

};

#define UART1 (*(volatile struct UART1_tag *) 0x4006b000)

struct UART2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:5;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_BDH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_BDL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t UARTSWAI:1;
      uint64_t LOOPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_S1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_S2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t T8:1;
      uint64_t R8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_MA1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_MA2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BRFA:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:3;
      uint64_t LBKDDMAS:1;
      uint64_t ILDMAS:1;
      uint64_t RDMAS:1;
      uint64_t TCDMAS:1;
      uint64_t TDMAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_C5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:6;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_ED;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_MODEM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNP:2;
      uint64_t IREN:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_IR;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_PFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXOFE:1;
      uint64_t RESERVED:3;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_CFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t RXOF:1;
      uint64_t RESERVED:3;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_SFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_TWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_TCFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_RWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART2_RCFIFO;

