iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define UART4_2 (*(volatile struct UART4_2_tag *) 0x400ea000)

struct UART5_2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:5;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_BDH;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_BDL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t UARTSWAI:1;
      uint64_t LOOPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_C2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_S1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_S2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t T8:1;
      uint64_t R8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_C3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_D;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_MA1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_MA2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BRFA:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_C4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:3;
      uint64_t LBKDDMAS:1;
      uint64_t ILDMAS:1;
      uint64_t RDMAS:1;
      uint64_t TCDMAS:1;
      uint64_t TDMAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_C5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:6;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_ED;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_MODEM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TNP:2;
      uint64_t IREN:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_IR;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_PFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXOFE:1;
      uint64_t RESERVED:3;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_CFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t RXOF:1;
      uint64_t RESERVED:3;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_SFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_TWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_TCFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXWATER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_RWFIFO;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RXCOUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UART5_RCFIFO;

};

#define UART5_2 (*(volatile struct UART5_2_tag *) 0x400eb000)

struct USB0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t RESERVED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_PERID;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NID:6;
      uint64_t RESERVED:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_IDCOMP;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t REV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_REV;

  uint8_t res2[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t IEHOST:1;
      uint64_t RESERVED:2;
      uint64_t IRQNUM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ADDINFO;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AVBUSCHG:1;
      uint64_t RESERVED_0:1;
      uint64_t B_SESS_CHG:1;
      uint64_t SESSVLDCHG:1;
      uint64_t RESERVED_1:1;
      uint64_t LINE_STATE_CHG:1;
      uint64_t ONEMSEC:1;
      uint64_t IDCHG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_OTGISTAT;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AVBUSEN:1;
      uint64_t RESERVED_0:1;
      uint64_t BSESSEN:1;
      uint64_t SESSVLDEN:1;
      uint64_t RESERVED_1:1;
      uint64_t LINESTATEEN:1;
      uint64_t ONEMSECEN:1;
      uint64_t IDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_OTGICR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AVBUSVLD:1;
      uint64_t RESERVED_0:1;
      uint64_t BSESSEND:1;
      uint64_t SESS_VLD:1;
      uint64_t RESERVED_1:1;
      uint64_t LINESTATESTABLE:1;
      uint64_t ONEMSECEN:1;
      uint64_t ID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_OTGSTAT;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t OTGEN:1;
      uint64_t RESERVED_1:1;
      uint64_t DMLOW:1;
      uint64_t DPLOW:1;
      uint64_t RESERVED_2:1;
      uint64_t DPHIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_OTGCTL;

  uint8_t res7[99];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USBRST:1;
      uint64_t ERROR:1;
      uint64_t SOFTOK:1;
      uint64_t TOKDNE:1;
      uint64_t SLEEP:1;
      uint64_t RESUME:1;
      uint64_t ATTACH:1;
      uint64_t STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ISTAT;

