iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res8[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USBRSTEN:1;
      uint64_t ERROREN:1;
      uint64_t SOFTOKEN:1;
      uint64_t TOKDNEEN:1;
      uint64_t SLEEPEN:1;
      uint64_t RESUMEEN:1;
      uint64_t ATTACHEN:1;
      uint64_t STALLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_INTEN;

  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PIDERR:1;
      uint64_t CRC5EOF:1;
      uint64_t CRC16:1;
      uint64_t DFN8:1;
      uint64_t BTOERR:1;
      uint64_t DMAERR:1;
      uint64_t RESERVED:1;
      uint64_t BTSERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ERRSTAT;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PIDERREN:1;
      uint64_t CRC5EOFEN:1;
      uint64_t CRC16EN:1;
      uint64_t DFN8EN:1;
      uint64_t BTOERREN:1;
      uint64_t DMAERREN:1;
      uint64_t RESERVED:1;
      uint64_t BTSERREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ERREN;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:2;
      uint64_t ODD:1;
      uint64_t TX:1;
      uint64_t ENDP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_STAT;

  uint8_t res12[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USBENSOFEN:1;
      uint64_t ODDRST:1;
      uint64_t RESUME:1;
      uint64_t HOSTMODEEN:1;
      uint64_t RESET:1;
      uint64_t TXSUSPENDTOKENBUSY:1;
      uint64_t SE0:1;
      uint64_t JSTATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_CTL;

  uint8_t res13[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ADDR:7;
      uint64_t LSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ADDR;

  uint8_t res14[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:1;
      uint64_t BDTBA:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_BDTPAGE1;

  uint8_t res15[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FRM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_FRMNUML;

  uint8_t res16[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FRM:3;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_FRMNUMH;

  uint8_t res17[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TOKENENDPT:4;
      uint64_t TOKENPID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_TOKEN;

  uint8_t res18[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_SOFTHLD;

  uint8_t res19[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BDTBA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_BDTPAGE2;

  uint8_t res20[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BDTBA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_BDTPAGE3;

  uint8_t res21[11];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT0;

  uint8_t res22[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT1;

  uint8_t res23[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT2;

  uint8_t res24[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT3;

  uint8_t res25[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT4;

  uint8_t res26[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT5;

  uint8_t res27[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT6;

  uint8_t res28[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT7;

  uint8_t res29[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT8;

  uint8_t res30[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT9;

  uint8_t res31[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT10;

  uint8_t res32[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT11;

  uint8_t res33[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT12;

  uint8_t res34[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT13;

  uint8_t res35[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT14;

  uint8_t res36[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EPHSHK:1;
      uint64_t EPSTALL:1;
      uint64_t EPTXEN:1;
      uint64_t EPRXEN:1;
      uint64_t EPCTLDIS:1;
      uint64_t RESERVED:1;
      uint64_t RETRYDIS:1;
      uint64_t HOSTWOHUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_ENDPT15;

  uint8_t res37[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED:6;
      uint64_t PDE:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_USBCTRL;

