iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res38[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:3;
      uint64_t DMPD:1;
      uint64_t RESERVED_2:1;
      uint64_t DPPD:1;
      uint64_t DPPU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_OBSERVE;

  uint8_t res39[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t DPPULLUPNONOTG:1;
      uint64_t RESERVED_1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_CONTROL;

  uint8_t res40[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USB_RESUME_INT:1;
      uint64_t SYNC_DET:1;
      uint64_t USB_CLK_RECOVERY_INT:1;
      uint64_t RESERVED_0:2;
      uint64_t USBRESMEN:1;
      uint64_t RESERVED_1:1;
      uint64_t USBRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_USBTRC0;

  uint8_t res41[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ADJ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_USBFRMADJUST;

  uint8_t res42[43];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:2;
      uint64_t RESTART_IFRTRIM_EN:1;
      uint64_t RESET_RESUME_ROUGH_EN:1;
      uint64_t CLOCK_RECOVER_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_CLK_RECOVER_CTRL;

  uint8_t res43[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t REG_EN:1;
      uint64_t IRC_EN:1;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_CLK_RECOVER_IRC_EN;

  uint8_t res44[23];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t OVF_ERROR:1;
      uint64_t RESERVED_1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USB0_CLK_RECOVER_INT_STATUS;

};

#define USB0 (*(volatile struct USB0_tag *) 0x40072000)

struct CMP0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t FILTER_CNT:3;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_CR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INV:1;
      uint64_t PMODE:1;
      uint64_t RESERVED:1;
      uint64_t WE:1;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_CR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_FPR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t RESERVED_0:1;
      uint64_t DMAEN:1;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_SCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VOSEL:6;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_DACCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t RESERVED:1;
      uint64_t PSTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP0_MUXCR;

};

#define CMP0 (*(volatile struct CMP0_tag *) 0x40073000)

struct CMP1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t FILTER_CNT:3;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_CR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INV:1;
      uint64_t PMODE:1;
      uint64_t RESERVED:1;
      uint64_t WE:1;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_CR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_FPR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t RESERVED_0:1;
      uint64_t DMAEN:1;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_SCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VOSEL:6;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_DACCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t RESERVED:1;
      uint64_t PSTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP1_MUXCR;

};

#define CMP1 (*(volatile struct CMP1_tag *) 0x40073008)

struct CMP2_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t FILTER_CNT:3;
      uint64_t RESERVED_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_CR0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INV:1;
      uint64_t PMODE:1;
      uint64_t RESERVED:1;
      uint64_t WE:1;
      uint64_t SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_CR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILT_PER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_FPR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t RESERVED_0:1;
      uint64_t DMAEN:1;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_SCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VOSEL:6;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_DACCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t RESERVED:1;
      uint64_t PSTM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMP2_MUXCR;

