iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define CMP2 (*(volatile struct CMP2_tag *) 0x40073010)

struct VREF_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRIM:6;
      uint64_t CHOPEN:1;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VREF_TRM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MODE_LV:2;
      uint64_t VREFST:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t ICOMPEN:1;
      uint64_t REGEN:1;
      uint64_t VREFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VREF_SC;

};

#define VREF (*(volatile struct VREF_tag *) 0x40074000)

struct LLWU_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE0:2;
      uint64_t WUPE1:2;
      uint64_t WUPE2:2;
      uint64_t WUPE3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_PE1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE4:2;
      uint64_t WUPE5:2;
      uint64_t WUPE6:2;
      uint64_t WUPE7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_PE2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE8:2;
      uint64_t WUPE9:2;
      uint64_t WUPE10:2;
      uint64_t WUPE11:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_PE3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUPE12:2;
      uint64_t WUPE13:2;
      uint64_t WUPE14:2;
      uint64_t WUPE15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_PE4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUME0:1;
      uint64_t WUME1:1;
      uint64_t WUME2:1;
      uint64_t WUME3:1;
      uint64_t WUME4:1;
      uint64_t WUME5:1;
      uint64_t WUME6:1;
      uint64_t WUME7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_ME;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUF0:1;
      uint64_t WUF1:1;
      uint64_t WUF2:1;
      uint64_t WUF3:1;
      uint64_t WUF4:1;
      uint64_t WUF5:1;
      uint64_t WUF6:1;
      uint64_t WUF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_F1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUF8:1;
      uint64_t WUF9:1;
      uint64_t WUF10:1;
      uint64_t WUF11:1;
      uint64_t WUF12:1;
      uint64_t WUF13:1;
      uint64_t WUF14:1;
      uint64_t WUF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_F2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MWUF0:1;
      uint64_t MWUF1:1;
      uint64_t MWUF2:1;
      uint64_t MWUF3:1;
      uint64_t MWUF4:1;
      uint64_t MWUF5:1;
      uint64_t MWUF6:1;
      uint64_t MWUF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_F3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILTSEL:4;
      uint64_t RESERVED:1;
      uint64_t FILTE:2;
      uint64_t FILTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_FILT1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FILTSEL:4;
      uint64_t RESERVED:1;
      uint64_t FILTE:2;
      uint64_t FILTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_FILT2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTFILT:1;
      uint64_t LLRSTE:1;
      uint64_t RESERVED:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LLWU_RST;

};

#define LLWU (*(volatile struct LLWU_tag *) 0x4007c000)

struct PMC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t LVDV:2;
      uint64_t RESERVED:2;
      uint64_t LVDRE:1;
      uint64_t LVDIE:1;
      uint64_t LVDACK:1;
      uint64_t LVDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LVWV:2;
      uint64_t RESERVED:3;
      uint64_t LVWIE:1;
      uint64_t LVWACK:1;
      uint64_t LVWF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BGBE:1;
      uint64_t RESERVED_0:1;
      uint64_t REGONS:1;
      uint64_t ACKISO:1;
      uint64_t BGEN:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_REGSC;

};

#define PMC (*(volatile struct PMC_tag *) 0x4007d000)

struct SMC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t AVLLS:1;
      uint64_t RESERVED_1:1;
      uint64_t ALLS:1;
      uint64_t RESERVED_2:1;
      uint64_t AVLP:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SMC_PMPROT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STOPM:3;
      uint64_t STOPA:1;
      uint64_t RESERVED:1;
      uint64_t RUNM:2;
      uint64_t LPWUI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SMC_PMCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VLLSM:3;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t PORPO:1;
      uint64_t RESERVED_2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SMC_VLLSCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMSTAT:7;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SMC_PMSTAT;

};

#define SMC (*(volatile struct SMC_tag *) 0x4007e000)

struct RCM_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t WAKEUP:1;
      uint64_t LVD:1;
      uint64_t LOC:1;
      uint64_t LOL:1;
      uint64_t RESERVED:1;
      uint64_t WDOG_bitfield:1;
      uint64_t PIN:1;
      uint64_t POR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCM_SRS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t JTAG:1;
      uint64_t LOCKUP:1;
      uint64_t SW:1;
      uint64_t MDM_AP:1;
      uint64_t EZPT:1;
      uint64_t SACKERR:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCM_SRS1;

  uint8_t res0[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTFLTSRW:2;
      uint64_t RSTFLTSS:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCM_RPFC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RSTFLTSEL:5;
      uint64_t RESERVED:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCM_RPFW;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t EZP_MS:1;
      uint64_t RESERVED_1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCM_MR;

