iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define RCM (*(volatile struct RCM_tag *) 0x4007f000)

struct SDHC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:2;
      uint64_t DSADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_DSADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLKSIZE:13;
      uint64_t RESERVED:3;
      uint64_t BLKCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_BLKATTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_CMDARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t BCEN:1;
      uint64_t AC12EN:1;
      uint64_t RESERVED_0:1;
      uint64_t DTDSEL:1;
      uint64_t MSBSEL:1;
      uint64_t RESERVED_1:10;
      uint64_t RSPTYP:2;
      uint64_t RESERVED_2:1;
      uint64_t CCCEN:1;
      uint64_t CICEN:1;
      uint64_t DPSEL:1;
      uint64_t CMDTYP:2;
      uint64_t CMDINX:6;
      uint64_t RESERVED_3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_XFERTYP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_CMDRSP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_CMDRSP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_CMDRSP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDRSP3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_CMDRSP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATCONT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_DATPORT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIHB:1;
      uint64_t CDIHB:1;
      uint64_t DLA:1;
      uint64_t SDSTB:1;
      uint64_t IPGOFF:1;
      uint64_t HCKOFF:1;
      uint64_t PEROFF:1;
      uint64_t SDOFF:1;
      uint64_t WTA:1;
      uint64_t RTA:1;
      uint64_t BWEN:1;
      uint64_t BREN:1;
      uint64_t RESERVED_0:4;
      uint64_t CINS:1;
      uint64_t RESERVED_1:6;
      uint64_t CLSL:1;
      uint64_t DLSL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_PRSSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCTL:1;
      uint64_t DTW:2;
      uint64_t D3CD:1;
      uint64_t EMODE:2;
      uint64_t CDTL:1;
      uint64_t CDSS:1;
      uint64_t DMAS:2;
      uint64_t RESERVED_0:6;
      uint64_t SABGREQ:1;
      uint64_t CREQ:1;
      uint64_t RWCTL:1;
      uint64_t IABG:1;
      uint64_t RESERVED_1:4;
      uint64_t WECINT:1;
      uint64_t WECINS:1;
      uint64_t WECRM:1;
      uint64_t RESERVED_2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_PROCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPGEN:1;
      uint64_t HCKEN:1;
      uint64_t PEREN:1;
      uint64_t SDCLKEN:1;
      uint64_t DVS:4;
      uint64_t SDCLKFS:8;
      uint64_t DTOCV:4;
      uint64_t RESERVED_0:4;
      uint64_t RSTA:1;
      uint64_t RSTC:1;
      uint64_t RSTD:1;
      uint64_t INITA:1;
      uint64_t RESERVED_1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_SYSCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:1;
      uint64_t TC:1;
      uint64_t BGE:1;
      uint64_t DINT:1;
      uint64_t BWR:1;
      uint64_t BRR:1;
      uint64_t CINS:1;
      uint64_t CRM:1;
      uint64_t CINT:1;
      uint64_t RESERVED_0:7;
      uint64_t CTOE:1;
      uint64_t CCE:1;
      uint64_t CEBE:1;
      uint64_t CIE:1;
      uint64_t DTOE:1;
      uint64_t DCE:1;
      uint64_t DEBE:1;
      uint64_t RESERVED_1:1;
      uint64_t AC12E:1;
      uint64_t RESERVED_2:3;
      uint64_t DMAE:1;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_IRQSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCSEN:1;
      uint64_t TCSEN:1;
      uint64_t BGESEN:1;
      uint64_t DINTSEN:1;
      uint64_t BWRSEN:1;
      uint64_t BRRSEN:1;
      uint64_t CINSEN:1;
      uint64_t CRMSEN:1;
      uint64_t CINTSEN:1;
      uint64_t RESERVED_0:7;
      uint64_t CTOESEN:1;
      uint64_t CCESEN:1;
      uint64_t CEBESEN:1;
      uint64_t CIESEN:1;
      uint64_t DTOESEN:1;
      uint64_t DCESEN:1;
      uint64_t DEBESEN:1;
      uint64_t RESERVED_1:1;
      uint64_t AC12ESEN:1;
      uint64_t RESERVED_2:3;
      uint64_t DMAESEN:1;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_IRQSTATEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCIEN:1;
      uint64_t TCIEN:1;
      uint64_t BGEIEN:1;
      uint64_t DINTIEN:1;
      uint64_t BWRIEN:1;
      uint64_t BRRIEN:1;
      uint64_t CINSIEN:1;
      uint64_t CRMIEN:1;
      uint64_t CINTIEN:1;
      uint64_t RESERVED_0:7;
      uint64_t CTOEIEN:1;
      uint64_t CCEIEN:1;
      uint64_t CEBEIEN:1;
      uint64_t CIEIEN:1;
      uint64_t DTOEIEN:1;
      uint64_t DCEIEN:1;
      uint64_t DEBEIEN:1;
      uint64_t RESERVED_1:1;
      uint64_t AC12EIEN:1;
      uint64_t RESERVED_2:3;
      uint64_t DMAEIEN:1;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_IRQSIGEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AC12NE:1;
      uint64_t AC12TOE:1;
      uint64_t AC12EBE:1;
      uint64_t AC12CE:1;
      uint64_t AC12IE:1;
      uint64_t RESERVED_0:2;
      uint64_t CNIBAC12E:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_AC12ERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:16;
      uint64_t MBL:3;
      uint64_t RESERVED_1:1;
      uint64_t ADMAS:1;
      uint64_t HSS:1;
      uint64_t DMAS:1;
      uint64_t SRS:1;
      uint64_t VS33:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_HTCAPBLT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDWML:8;
      uint64_t RESERVED_0:5;
      uint64_t RESERVED_1:3;
      uint64_t WRWML:8;
      uint64_t RESERVED_2:5;
      uint64_t RESERVED_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_WML;

