iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AC12NE:1;
      uint64_t AC12TOE:1;
      uint64_t AC12CE:1;
      uint64_t AC12EBE:1;
      uint64_t AC12IE:1;
      uint64_t RESERVED_0:2;
      uint64_t CNIBAC12E:1;
      uint64_t RESERVED_1:8;
      uint64_t CTOE:1;
      uint64_t CCE:1;
      uint64_t CEBE:1;
      uint64_t CIE:1;
      uint64_t DTOE:1;
      uint64_t DCE:1;
      uint64_t DEBE:1;
      uint64_t RESERVED_2:1;
      uint64_t AC12E:1;
      uint64_t RESERVED_3:3;
      uint64_t DMAE:1;
      uint64_t RESERVED_4:2;
      uint64_t CINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_FEVT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADMAES:2;
      uint64_t ADMALME:1;
      uint64_t ADMADCE:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_ADMAES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:2;
      uint64_t ADSADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_ADSADDR;

  uint8_t res1[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTDMAEN:1;
      uint64_t EXBLKNU:1;
      uint64_t RESERVED_0:14;
      uint64_t INTSTVAL:8;
      uint64_t RESERVED_1:4;
      uint64_t RESERVED_2:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_VENDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCVACK:4;
      uint64_t BOOTACK:1;
      uint64_t BOOTMODE:1;
      uint64_t BOOTEN:1;
      uint64_t AUTOSABGEN:1;
      uint64_t RESERVED:8;
      uint64_t BOOTBLKCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_MMCBOOT;

  uint8_t res2[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SVN:8;
      uint64_t VVN:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDHC_HOSTVER;

};

#define SDHC (*(volatile struct SDHC_tag *) 0x400b1000)

struct ENET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:8;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:3;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:2;
      uint64_t TS_TIMER:1;
      uint64_t TS_AVAIL:1;
      uint64_t WAKEUP:1;
      uint64_t PLR:1;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
      uint64_t RESERVED_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:12;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:2;
      uint64_t TS_TIMER:1;
      uint64_t TS_AVAIL:1;
      uint64_t WAKEUP:1;
      uint64_t PLR:1;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
      uint64_t RESERVED_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_EIMR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:24;
      uint64_t RDAR:1;
      uint64_t RESERVED_1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RDAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:24;
      uint64_t TDAR:1;
      uint64_t RESERVED_1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TDAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t ETHEREN:1;
      uint64_t MAGICEN:1;
      uint64_t SLEEP:1;
      uint64_t EN1588:1;
      uint64_t RESERVED_0:1;
      uint64_t DBGEN:1;
      uint64_t STOPEN:1;
      uint64_t DBSWP:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ECR;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t TA:2;
      uint64_t RA:5;
      uint64_t PA:5;
      uint64_t OP:2;
      uint64_t ST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MMFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MII_SPEED:6;
      uint64_t DIS_PRE:1;
      uint64_t HOLDTIME:3;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MSCR;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED:29;
      uint64_t MIB_CLEAR:1;
      uint64_t MIB_IDLE:1;
      uint64_t MIB_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MIBC;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOP:1;
      uint64_t DRT:1;
      uint64_t MII_MODE:1;
      uint64_t PROM:1;
      uint64_t BC_REJ:1;
      uint64_t FCE:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RMII_MODE:1;
      uint64_t RMII_10T:1;
      uint64_t RESERVED_2:2;
      uint64_t PADEN:1;
      uint64_t PAUFWD:1;
      uint64_t CRCFWD:1;
      uint64_t CFEN:1;
      uint64_t MAX_FL:14;
      uint64_t NLC:1;
      uint64_t GRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RCR;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GTS:1;
      uint64_t RESERVED_0:1;
      uint64_t FDEN:1;
      uint64_t TFC_PAUSE:1;
      uint64_t RFC_PAUSE:1;
      uint64_t ADDSEL:3;
      uint64_t ADDINS:1;
      uint64_t CRCFWD:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCR;

  uint8_t res6[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_PALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:16;
      uint64_t PADDR2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_PAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSE_DUR:16;
      uint64_t OPCODE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_OPD;

  uint8_t res7[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_GAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_GALR;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFWR:6;
      uint64_t RESERVED_0:2;
      uint64_t STRFWD:1;
      uint64_t RESERVED_1:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TFWR;

