iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res9[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t RESERVED_1:1;
      uint64_t R_DES_START:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t RESERVED_1:1;
      uint64_t X_DES_START:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:4;
      uint64_t R_BUF_SIZE:10;
      uint64_t RESERVED_1:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MRBR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_SECTION_FULL:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RSFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_SECTION_EMPTY:8;
      uint64_t RESERVED_0:8;
      uint64_t STAT_SECTION_EMPTY:5;
      uint64_t RESERVED_1:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RSEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ALMOST_EMPTY:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RAEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ALMOST_FULL:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RAFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_SECTION_EMPTY:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TSEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_ALMOST_EMPTY:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TAEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_ALMOST_FULL:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TAFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPG:5;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TIPG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRUNC_FL:14;
      uint64_t RESERVED:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_FTRL;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFT16:1;
      uint64_t RESERVED_0:2;
      uint64_t IPCHK:1;
      uint64_t PROCHK:1;
      uint64_t RESERVED_1:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TACC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADREM:1;
      uint64_t IPDIS:1;
      uint64_t PRODIS:1;
      uint64_t RESERVED_0:3;
      uint64_t LINEDIS:1;
      uint64_t SHIFT16:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RACC;

  uint8_t res12[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_JAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXOCTS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_OCTETS;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_1COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_MCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_DEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_LCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_EXCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_CSERR;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_OCTETS_OK;

