iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res15[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_JAB;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_OCTETS_OK;

  uint8_t res17[284];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t RESERVED_0:1;
      uint64_t OFFEN:1;
      uint64_t OFFRST:1;
      uint64_t PEREN:1;
      uint64_t RESERVED_1:2;
      uint64_t PINPER:1;
      uint64_t RESERVED_2:1;
      uint64_t RESTART:1;
      uint64_t RESERVED_3:1;
      uint64_t CAPTURE:1;
      uint64_t RESERVED_4:1;
      uint64_t SLAVE:1;
      uint64_t RESERVED_5:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COR:31;
      uint64_t RESERVED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INC:7;
      uint64_t RESERVED_0:1;
      uint64_t INC_CORR:7;
      uint64_t RESERVED_1:17;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATSTMP;

  uint8_t res18[488];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF0:1;
      uint64_t TF1:1;
      uint64_t TF2:1;
      uint64_t TF3:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t RESERVED_0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t RESERVED_0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t RESERVED_0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t RESERVED_0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR3;

