iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define ENET (*(volatile struct ENET_tag *) 0x400c0004)

struct DAC0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT0L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT0H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT1L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT1H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT2L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT2H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT3L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT3H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT4L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT4H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT5L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT5H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT6L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT6H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT7L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT7H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT8L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT8H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT9L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT9H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT10L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT10H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT11L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT11H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT12L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT12H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT13L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT13H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT14L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT14H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT15L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_DAT15H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFRPBF:1;
      uint64_t DACBFRPTF:1;
      uint64_t DACBFWMF:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_SR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBBIEN:1;
      uint64_t DACBTIEN:1;
      uint64_t DACBWIEN:1;
      uint64_t LPEN:1;
      uint64_t DACSWTRG:1;
      uint64_t DACTRGSEL:1;
      uint64_t DACRFS:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_C0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFEN:1;
      uint64_t DACBFMD:2;
      uint64_t DACBFWM:2;
      uint64_t RESERVED:2;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFUP:4;
      uint64_t DACBFRP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC0_C2;

