iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define DAC0 (*(volatile struct DAC0_tag *) 0x400cc000)

struct DAC1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT0L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT0H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT1L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT1H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT2L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT2H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT3L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT3H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT4L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT4H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT5L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT5H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT6L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT6H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT7L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT7H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT8L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT8H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT9L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT9H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT10L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT10H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT11L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT11H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT12L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT12H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT13L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT13H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT14L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT14H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT15L;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA1:4;
      uint64_t RESERVED:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_DAT15H;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFRPBF:1;
      uint64_t DACBFRPTF:1;
      uint64_t DACBFWMF:1;
      uint64_t RESERVED:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_SR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBBIEN:1;
      uint64_t DACBTIEN:1;
      uint64_t DACBWIEN:1;
      uint64_t LPEN:1;
      uint64_t DACSWTRG:1;
      uint64_t DACTRGSEL:1;
      uint64_t DACRFS:1;
      uint64_t DACEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_C0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFEN:1;
      uint64_t DACBFMD:2;
      uint64_t DACBFWM:2;
      uint64_t RESERVED:2;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_C1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DACBFUP:4;
      uint64_t DACBFRP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC1_C2;

