iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define DAC1 (*(volatile struct DAC1_tag *) 0x400cd000)

struct PTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDDR;

};

#define PTA (*(volatile struct PTA_tag *) 0x400ff000)

struct PTB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDDR;

};

#define PTB (*(volatile struct PTB_tag *) 0x400ff040)

struct PTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOC_PDDR;

};

#define PTC (*(volatile struct PTC_tag *) 0x400ff080)

struct PTD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOD_PDDR;

};

#define PTD (*(volatile struct PTD_tag *) 0x400ff0c0)

struct PTE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOE_PDDR;

};

#define PTE (*(volatile struct PTE_tag *) 0x400ff100)

struct MCM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t ASC:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MCM_PLASC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:8;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MCM_PLAMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:9;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:14;
      uint64_t SRAMUAP:2;
      uint64_t SRAMUWP:1;
      uint64_t RESERVED_3:1;
      uint64_t SRAMLAP:2;
      uint64_t SRAMLWP:1;
      uint64_t RESERVED_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t IRQ:1;
      uint64_t NMI:1;
      uint64_t DHREQ:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:3;
      uint64_t FIOC:1;
      uint64_t FDZC:1;
      uint64_t FOFC:1;
      uint64_t FUFC:1;
      uint64_t FIXC:1;
      uint64_t RESERVED_3:2;
      uint64_t FIDC:1;
      uint64_t RESERVED_4:8;
      uint64_t FIOCE:1;
      uint64_t FDZCE:1;
      uint64_t FOFCE:1;
      uint64_t FUFCE:1;
      uint64_t FIXCE:1;
      uint64_t RESERVED_5:2;
      uint64_t FIDCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_ISCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTEN:1;
      uint64_t RSPT:2;
      uint64_t RLRQ:1;
      uint64_t ETDIS:1;
      uint64_t ITDIS:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_ETBCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:11;
      uint64_t RESERVED:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_ETBRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:11;
      uint64_t RESERVED:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_ETBCNT;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_PID;

