iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
};

#define MCM (*(volatile struct MCM_tag *) 0xe0080008)

struct CAU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_DIRECT15;

  uint8_t res0[2048];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC:1;
      uint64_t DPE:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t VER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CAA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_LDR_CA3;

