iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/Kinetis/targetInit/kinetisK64_sfr.h
  uint8_t res6[276];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC:1;
      uint64_t DPE:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t VER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CAA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESC_CA8;

  uint8_t res7[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC:1;
      uint64_t DPE:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t VER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CASR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CAA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:1;
      uint64_t RESERVED_4:1;
      uint64_t RESERVED_5:1;
      uint64_t RESERVED_6:1;
      uint64_t RESERVED_7:1;
      uint64_t RESERVED_8:1;
      uint64_t RESERVED_9:1;
      uint64_t RESERVED_10:1;
      uint64_t RESERVED_11:1;
      uint64_t RESERVED_12:1;
      uint64_t RESERVED_13:1;
      uint64_t RESERVED_14:1;
      uint64_t RESERVED_15:1;
      uint64_t RESERVED_16:1;
      uint64_t RESERVED_17:1;
      uint64_t RESERVED_18:1;
      uint64_t RESERVED_19:1;
      uint64_t RESERVED_20:1;
      uint64_t RESERVED_21:1;
      uint64_t RESERVED_22:1;
      uint64_t RESERVED_23:1;
      uint64_t RESERVED_24:1;
      uint64_t RESERVED_25:1;
      uint64_t RESERVED_26:1;
      uint64_t RESERVED_27:1;
      uint64_t RESERVED_28:1;
      uint64_t RESERVED_29:1;
      uint64_t RESERVED_30:1;
      uint64_t RESERVED_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAU_AESIC_CA8;

};

#define CAU (*(volatile struct CAU_tag *) 0xe0081000)

